#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/Skryba/skryba-cli/runs/run-K6CDGRP1xhR97LBi

Waiting for the plan to start...

Terraform v0.14.9
Configuring remote state backend...
Initializing Terraform configuration...
aws_eip.eip_manager: Refreshing state... [id=eipalloc-032e61ca2263d7560]
aws_vpc.app_vpc: Refreshing state... [id=vpc-0e44f2be2b939ad30]
aws_ecs_cluster.api_cluster: Refreshing state... [id=arn:aws:ecs:eu-west-1:086627185220:cluster/api_cluster]
aws_cloudwatch_log_group.api_logs: Refreshing state... [id=api-logs]
aws_iam_role.ecs_role: Refreshing state... [id=ecs_app]
aws_s3_bucket.client_bucket: Refreshing state... [id=app.skryba.link]
aws_iam_role_policy_attachment.ecs_policy_attachment: Refreshing state... [id=ecs_app-20210330064734424000000001]
aws_ecs_task_definition.api_task: Refreshing state... [id=api]
aws_internet_gateway.internet_gateway: Refreshing state... [id=igw-0c5946ec0a2824c2c]
aws_subnet.public_a: Refreshing state... [id=subnet-049101940294b624e]
aws_security_group.api_sg: Refreshing state... [id=sg-04cc1b496cbf9be40]
aws_subnet.public_b: Refreshing state... [id=subnet-0dddc64cd9c96eb65]
aws_route.internet_access: Refreshing state... [id=r-rtb-0144b6b6e17a7ecf71080289494]
aws_ecs_service.api_service: Refreshing state... [id=arn:aws:ecs:eu-west-1:086627185220:service/api_cluster/api_service]
time_sleep.sigserv_30_seconds: Refreshing state... [id=2021-03-30T06:49:39Z]
aws_route53_record.app: Refreshing state... [id=Z00408931X4PHFVTCW5MH_api_A]
aws_s3_bucket_policy.client_bucket_policy: Refreshing state... [id=app.skryba.link]
aws_cloudfront_distribution.fronted_cloudfront: Refreshing state... [id=E3OL1VEF0SI734]
aws_route53_record.frontend: Refreshing state... [id=Z00408931X4PHFVTCW5MH_app_A]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_network_interface.networkinterfacesigserv will be read during apply
  # (config refers to values not yet known)
 <= data "aws_network_interface" "networkinterfacesigserv"  {
      ~ association       = [
          - {
              - allocation_id     = ""
              - association_id    = ""
              - carrier_ip        = ""
              - customer_owned_ip = ""
              - ip_owner_id       = "amazon"
              - public_dns_name   = "ec2-52-16-226-190.eu-west-1.compute.amazonaws.com"
              - public_ip         = "52.16.226.190"
            },
        ] -> (known after apply)
      ~ attachment        = [
          - {
              - attachment_id     = "eni-attach-0f13e382254229842"
              - device_index      = 1
              - instance_id       = ""
              - instance_owner_id = ""
            },
        ] -> (known after apply)
      ~ availability_zone = "eu-west-1b" -> (known after apply)
      ~ description       = "arn:aws:ecs:eu-west-1:086627185220:attachment/178806a5-4b73-4664-be23-dd036f9c40e2" -> (known after apply)
      ~ id                = "eni-01596d07ac329dced" -> (known after apply)
      ~ interface_type    = "interface" -> (known after apply)
      ~ ipv6_addresses    = [] -> (known after apply)
      ~ mac_address       = "0a:2e:39:cb:2a:c1" -> (known after apply)
      + outpost_arn       = (known after apply)
      ~ owner_id          = "086627185220" -> (known after apply)
      ~ private_dns_name  = "ip-10-0-2-198.eu-west-1.compute.internal" -> (known after apply)
      ~ private_ip        = "10.0.2.198" -> (known after apply)
      ~ private_ips       = [
          - "10.0.2.198",
        ] -> (known after apply)
      ~ requester_id      = "578734482556" -> (known after apply)
      ~ security_groups   = [
          - "sg-04cc1b496cbf9be40",
        ] -> (known after apply)
      ~ subnet_id         = "subnet-0dddc64cd9c96eb65" -> (known after apply)
      ~ tags              = {} -> (known after apply)
      ~ vpc_id            = "vpc-0e44f2be2b939ad30" -> (known after apply)
    }

  # data.aws_network_interfaces.networkinterfacesigserv will be read during apply
  # (config refers to values not yet known)
 <= data "aws_network_interfaces" "networkinterfacesigserv"  {
      ~ id   = "eu-west-1" -> (known after apply)
      ~ ids  = [
          - "eni-01596d07ac329dced",
        ] -> (known after apply)
      + tags = (known after apply)

        # (1 unchanged block hidden)
    }

  # aws_cloudfront_distribution.fronted_cloudfront will be updated in-place
  ~ resource "aws_cloudfront_distribution" "fronted_cloudfront" {
        id                             = "E3OL1VEF0SI734"
        tags                           = {}
      + web_acl_id                     = ""
        # (17 unchanged attributes hidden)





      ~ viewer_certificate {
          # Warning: this attribute value will be marked as sensitive and will
          # not display in UI output after applying this change
          ~ acm_certificate_arn            = (sensitive)
          + iam_certificate_id             = ""
            # (3 unchanged attributes hidden)
        }
        # (4 unchanged blocks hidden)
    }

  # aws_ecs_service.api_service will be updated in-place
  ~ resource "aws_ecs_service" "api_service" {
        id                                 = "arn:aws:ecs:eu-west-1:086627185220:service/api_cluster/api_service"
        name                               = "api_service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-west-1:086627185220:task-definition/api:28" -> (known after apply)
        # (14 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.api_task must be replaced
-/+ resource "aws_ecs_task_definition" "api_task" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:086627185220:task-definition/api:28" -> (known after apply)
      ~ container_definitions    = (sensitive) # forces replacement
      ~ id                       = "api" -> (known after apply)
      - ipc_mode                 = "" -> null
      - pid_mode                 = "" -> null
      ~ revision                 = 28 -> (known after apply)
      - tags                     = {} -> null
      - task_role_arn            = "" -> null
        # (6 unchanged attributes hidden)
    }

  # aws_route53_record.app will be updated in-place
  ~ resource "aws_route53_record" "app" {
        id      = "Z00408931X4PHFVTCW5MH_api_A"
        name    = "api"
      ~ records = [
          - "52.16.226.190",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.

Changes to Outputs:
  ~ ecs_privateipv4_sigserv = "10.0.2.198" -> (known after apply)
  ~ ecs_publicipv4_sigserv  = "52.16.226.190" -> (known after apply)
  ~ ecs_serv_data           = {
      ~ association       = [
          - {
              - allocation_id     = ""
              - association_id    = ""
              - carrier_ip        = ""
              - customer_owned_ip = ""
              - ip_owner_id       = "amazon"
              - public_dns_name   = "ec2-52-16-226-190.eu-west-1.compute.amazonaws.com"
              - public_ip         = "52.16.226.190"
            },
        ] -> (known after apply)
      ~ attachment        = [
          - {
              - attachment_id     = "eni-attach-0f13e382254229842"
              - device_index      = 1
              - instance_id       = ""
              - instance_owner_id = ""
            },
        ] -> (known after apply)
      ~ availability_zone = "eu-west-1b" -> (known after apply)
      ~ description       = "arn:aws:ecs:eu-west-1:086627185220:attachment/178806a5-4b73-4664-be23-dd036f9c40e2" -> (known after apply)
      ~ filter            = null -> []
      ~ id                = "eni-01596d07ac329dced" -> (known after apply)
      ~ interface_type    = "interface" -> (known after apply)
      ~ ipv6_addresses    = [] -> (known after apply)
      ~ mac_address       = "0a:2e:39:cb:2a:c1" -> (known after apply)
      ~ outpost_arn       = "" -> (known after apply)
      ~ owner_id          = "086627185220" -> (known after apply)
      ~ private_dns_name  = "ip-10-0-2-198.eu-west-1.compute.internal" -> (known after apply)
      ~ private_ip        = "10.0.2.198" -> (known after apply)
      ~ private_ips       = [
          - "10.0.2.198",
        ] -> (known after apply)
      ~ requester_id      = "578734482556" -> (known after apply)
      ~ security_groups   = [
          - "sg-04cc1b496cbf9be40",
        ] -> (known after apply)
      ~ subnet_id         = "subnet-0dddc64cd9c96eb65" -> (known after apply)
      ~ tags              = {} -> (known after apply)
      ~ vpc_id            = "vpc-0e44f2be2b939ad30" -> (known after apply)
    }
  ~ ecs_serv_interfaces     = {
      ~ id     = "eu-west-1" -> (known after apply)
      ~ ids    = [
          - "eni-01596d07ac329dced",
        ] -> (known after apply)
      ~ tags   = null -> (known after apply)
        # (1 unchanged element hidden)
    }

Warning: Value for undeclared variable

The root module does not declare a variable named "secret_key" but a value was
found in file "/terraform/terraform.tfvars". To use this value, add a
"variable" block to the configuration.

Using a variables file to set an undeclared variable is deprecated and will
become an error in a future release. If you wish to provide certain "global"
settings to all configurations in your organization, use TF_VAR_...
environment variables to set these instead.


Warning: Value for undeclared variable

The root module does not declare a variable named "access_key" but a value was
found in file "/terraform/terraform.tfvars". To use this value, add a
"variable" block to the configuration.

Using a variables file to set an undeclared variable is deprecated and will
become an error in a future release. If you wish to provide certain "global"
settings to all configurations in your organization, use TF_VAR_...
environment variables to set these instead.

```
</details>
*Pusher: @TheUnderScorer, Action: `pull_request`*